## Terraform Plan Verification
`terraform validate` result: success
`terraform init` result: success

```terraform
module.eks.module.kms.data.aws_caller_identity.current[0]: Reading...
module.eks.data.aws_iam_policy_document.node_assume_role_policy[0]: Reading...
module.eks.data.aws_caller_identity.current[0]: Reading...
data.aws_availability_zones.available: Reading...
module.eks.data.aws_partition.current[0]: Reading...
module.eks.module.kms.data.aws_partition.current[0]: Reading...
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/gal-cluster-cluster/cluster]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0f6e03d3deb2e6e5b]
module.eks.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2830595799]
module.eks.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.eks.data.aws_iam_policy_document.node_assume_role_policy[0]: Read complete after 0s [id=3518401652]
module.eks.aws_iam_role.this[0]: Refreshing state... [id=gal-cluster-cluster-cluster-20250714102810962500000003]
module.eks.aws_iam_role.eks_auto[0]: Refreshing state... [id=gal-cluster-cluster-eks-auto-20250714102810952800000001]
module.eks.data.aws_iam_policy_document.custom[0]: Reading...
module.eks.data.aws_iam_policy_document.custom[0]: Read complete after 0s [id=513122117]
module.eks.aws_iam_policy.custom[0]: Refreshing state... [id=arn:aws:iam::930579047961:policy/gal-cluster-cluster-cluster-20250714102810959200000002]
module.eks.module.kms.data.aws_caller_identity.current[0]: Read complete after 0s [id=930579047961]
module.eks.data.aws_caller_identity.current[0]: Read complete after 1s [id=930579047961]
module.eks.data.aws_iam_session_context.current[0]: Reading...
data.aws_availability_zones.available: Read complete after 1s [id=us-east-1]
module.eks.data.aws_iam_session_context.current[0]: Read complete after 0s [id=arn:aws:sts::930579047961:assumed-role/gal-cluster-github-actions-tf-role/GitHubActionsTerraformSession]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSBlockStoragePolicy"]: Refreshing state... [id=gal-cluster-cluster-cluster-20250714102810962500000003-2025071410281128080000000b]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSLoadBalancingPolicy"]: Refreshing state... [id=gal-cluster-cluster-cluster-20250714102810962500000003-20250714102811259800000009]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=gal-cluster-cluster-cluster-20250714102810962500000003-20250714102811225900000006]
module.eks.aws_iam_role_policy_attachment.custom[0]: Refreshing state... [id=gal-cluster-cluster-cluster-20250714102810962500000003-20250714102811220600000005]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSNetworkingPolicy"]: Refreshing state... [id=gal-cluster-cluster-cluster-20250714102810962500000003-20250714102811253200000008]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSComputePolicy"]: Refreshing state... [id=gal-cluster-cluster-cluster-20250714102810962500000003-20250714102811219900000004]
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Reading...
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=1040504437]
module.eks.module.kms.aws_kms_key.this[0]: Refreshing state... [id=9fad3bd3-8682-407f-997d-ac950273ed0d]
module.eks.aws_iam_role_policy_attachment.eks_auto["AmazonEC2ContainerRegistryPullOnly"]: Refreshing state... [id=gal-cluster-cluster-eks-auto-20250714102810952800000001-2025071410281126620000000a]
module.eks.aws_iam_role_policy_attachment.eks_auto["AmazonEKSWorkerNodeMinimalPolicy"]: Refreshing state... [id=gal-cluster-cluster-eks-auto-20250714102810952800000001-20250714102811228800000007]
module.eks.module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/gal-cluster-cluster]
module.eks.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::930579047961:policy/gal-cluster-cluster-cluster-ClusterEncryption2025071410283207900000000c]
module.eks.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=gal-cluster-cluster-cluster-20250714102810962500000003-2025071410283236620000000d]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0655269ad1c739cc3]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-09c3c2ada797c7ca7]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0877aa12dd6e20543]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-09eda8ecb4f8472b1]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-012c714254cf58f24]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0c29755ce70a5d761]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0a447902524dc2799]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0ae8aefc374193a52]
module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-001571b0bb40b8a5d]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-02f31c954ce57d1df]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0e6b43ee7fdc6318f]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-06f1382580c4bae9c]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-000bd07f0c3be17ea]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-02109c5eebd554b30]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-02350eaac8a63d88a]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0a447902524dc27991080289494]
module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-1613337311]
module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-1987947579]
module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-2398263068]
module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-1937092350]
module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-4039800021]
module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-4144498615]
module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-399809845]
module.eks.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-744929160]
module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-2842424649]
module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-1398252632]
module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-1853589213]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-003662f78487eb683]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-091459d29596d7185]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-087861e9eb0fc8b2f]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-06f1382580c4bae9c1080289494]
module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=gal-cluster-cluster]
module.eks.aws_ec2_tag.cluster_primary_security_group["ManagedBy"]: Refreshing state... [id=sg-07ca38fd054cd40c5,ManagedBy]
module.eks.aws_eks_access_entry.this["cluster_creator"]: Refreshing state... [id=gal-cluster-cluster:arn:aws:iam::930579047961:role/ec2-eks-admin-role]
module.eks.aws_ec2_tag.cluster_primary_security_group["Project"]: Refreshing state... [id=sg-07ca38fd054cd40c5,Project]
module.eks.time_sleep.this[0]: Refreshing state... [id=2025-07-14T10:44:18Z]
module.eks.data.tls_certificate.this[0]: Reading...
module.eks.data.tls_certificate.this[0]: Read complete after 0s [id=922877a0975ad078a65b8ff11ebc47b8311945c7]
module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::930579047961:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/4DF78490A19A4DAEF10A09509BE4B964]
module.eks.aws_eks_access_policy_association.this["cluster_creator_admin"]: Refreshing state... [id=gal-cluster-cluster#arn:aws:iam::930579047961:role/ec2-eks-admin-role#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.eks.aws_eks_access_entry.this["cluster_creator"] must be replaced
-/+ resource "aws_eks_access_entry" "this" {
      ~ access_entry_arn  = "arn:aws:eks:us-east-1:930579047961:access-entry/gal-cluster-cluster/role/930579047961/ec2-eks-admin-role/aecc0444-5099-adc0-989c-ae0057017ae4" -> (known after apply)
      ~ created_at        = "2025-07-14T10:43:48Z" -> (known after apply)
      ~ id                = "gal-cluster-cluster:arn:aws:iam::930579047961:role/ec2-eks-admin-role" -> (known after apply)
      ~ kubernetes_groups = [] -> (known after apply)
      ~ modified_at       = "2025-07-14T10:43:48Z" -> (known after apply)
      ~ principal_arn     = "arn:aws:iam::930579047961:role/ec2-eks-admin-role" -> "arn:aws:iam::930579047961:role/gal-cluster-github-actions-tf-role" # forces replacement
        tags              = {
            "ManagedBy" = "Terraform"
            "Project"   = "gal-cluster"
        }
      ~ user_name         = "arn:aws:sts::930579047961:assumed-role/ec2-eks-admin-role/{{SessionName}}" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.eks.aws_eks_access_policy_association.this["cluster_creator_admin"] must be replaced
-/+ resource "aws_eks_access_policy_association" "this" {
      ~ associated_at = "2025-07-14 10:43:49.438 +0000 UTC" -> (known after apply)
      ~ id            = "gal-cluster-cluster#arn:aws:iam::930579047961:role/ec2-eks-admin-role#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy" -> (known after apply)
      ~ modified_at   = "2025-07-14 10:43:49.438 +0000 UTC" -> (known after apply)
      ~ principal_arn = "arn:aws:iam::930579047961:role/ec2-eks-admin-role" -> "arn:aws:iam::930579047961:role/gal-cluster-github-actions-tf-role" # forces replacement
        # (2 unchanged attributes hidden)

      ~ access_scope {
          - namespaces = [] -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.eks.module.kms.aws_kms_key.this[0] will be updated in-place
  ~ resource "aws_kms_key" "this" {
        id                                 = "9fad3bd3-8682-407f-997d-ac950273ed0d"
      ~ policy                             = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action    = "kms:*"
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::930579047961:root"
                        }
                        Resource  = "*"
                        Sid       = "Default"
                    },
                  ~ {
                      ~ Principal = {
                          ~ AWS = "arn:aws:iam::930579047961:role/ec2-eks-admin-role" -> "arn:aws:iam::930579047961:role/gal-cluster-github-actions-tf-role"
                        }
                        # (4 unchanged attributes hidden)
                    },
                    {
                        Action    = [
                            "kms:ReEncrypt*",
                            "kms:GenerateDataKey*",
                            "kms:Encrypt",
                            "kms:DescribeKey",
                            "kms:Decrypt",
                        ]
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::930579047961:role/gal-cluster-cluster-cluster-20250714102810962500000003"
                        }
                        Resource  = "*"
                        Sid       = "KeyUsage"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags                               = {
            "ManagedBy"             = "Terraform"
            "Project"               = "gal-cluster"
            "terraform-aws-modules" = "eks"
        }
        # (13 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
